app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    respond_to do |format|
      format.html do
        @articles = Article.all

INSERT INTO "articles" ("title", "text") VALUES (?, ?)  [["title", "fdgs"], ["text", "gdsfgd"]]
---
  def create
    article = Article.new article_params
    if article.save

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy
    article = Article.find_by_id params[:id]
    if article
      article.destroy